{
    "mensuracao2025fraga": {
        "abstract": "O método de mensuração de ativos financeiros em planos de previdência na modalidade de contribuição definida (CD, ou contribuição variável - CV, na fase de acumulação) tem implicações significativas se haverá transferência de riqueza entre os participantes. Em Dez/2024 foi publicada norma para as Entidades Fechadas de Previdência Complementar possibilitando o uso da marcação na curva de títulos públicos federais nos planos CD e CV na fase de acumulação. Este artigo quantifica o impacto financeiro nos participantes da adoção da marcação na curva (HTM – Hold to Maturity) nestes planos, utilizando dados reais da estrutura a termo da taxa de juros de cupom de IPCA para avaliar as transferências de riqueza resultantes dessa adoção. A análise evidencia como a marcação na curva gera assimetrias nos resultados financeiros, beneficiando alguns participantes em detrimento de outros. As transferências de riqueza ocorrem tanto em qualquer retirada de recursos quanto também na entrada (contribuições), inclusive realocações da carteira que impliquem venda ou compra de títulos. O uso do HTM de forma parcial ou a tentativa de imunização de saídas não eliminam por completo transferências de riqueza. Os resultados reforçam que, para fins de cotização, o uso da marcação a mercado (MTM - Mark to Market) de ativos em planos CD (e CV na fase de diferimento) evita transferências de riqueza e, por consequência, prejuízos financeiros aos seus participantes.",
        "url": "https://doi.org/10.12660/rbfin.v23n1.2025.93303",
        "journal": "Revista Brasileira de Finanças (RBFin)",
        "year": "2025",
        "author": "Fraga L. de Melo, Eduardo and Targino, Rodrigo S.",
        "title": "Mensuração da Transferência de Riqueza em Planos de Contribuição Definida com a Marcação de Ativos na Curva",
        "ENTRYTYPE": "unpublished",
        "ID": "mensuracao2025fraga"
    },
    "duarte2025press": {
        "publisher": "Portfolio Management Research",
        "year": "2025",
        "pages": "194--215",
        "number": "7",
        "volume": "51",
        "journal": "The Journal of Portfolio Management",
        "author": "Duarte, Diogo and Rouxelin, Florent and Saporito, Yuri F and Targino, Rodrigo",
        "title": "Press Freedom as a Risk Factor: Effects on Volatility and Uncertainty",
        "ENTRYTYPE": "article",
        "ID": "duarte2025press"
    },
    "pesenti2024risk": {
        "abstract": "We define and develop an approach for risk budgeting allocation—a risk diversification portfolio strategy—where risk is measured using a dynamic time-consistent risk measure. For this, we introduce a notion of dynamic risk contributions that generalize the classical Euler contributions, which allows us to obtain dynamic risk contributions in a recursive manner. We prove that for the class of coherent dynamic distortion risk measures, the risk allocation problem may be recast as a sequence of strictly convex optimization problems. Moreover, we show that self-financing dynamic risk budgeting strategies with initial wealth of one are scaled versions of the solution of the sequence of convex optimization problems. Furthermore, we develop an actor-critic approach, leveraging the elicitability of dynamic risk measures, to solve for risk budgeting strategies using deep learning.",
        "url": "https://doi.org/10.1287/opre.2023.0299",
        "publisher": "INFORMS",
        "pages": "1208--1229",
        "number": "3",
        "volume": "73",
        "year": "2024",
        "journal": "Operations Research",
        "author": "Pesenti, Silvana M and Jaimungal, Sebastian and Saporito, Yuri F and Targino, Rodrigo S",
        "title": "Risk budgeting allocation for dynamic risk measures",
        "ENTRYTYPE": "article",
        "ID": "pesenti2024risk"
    },
    "dacosta2023risk": {
        "abstract": "Risk budgeting is a portfolio strategy where each asset contributes a prespecified amount to the aggregate risk of the portfolio. In this work, we propose a numerical framework that uses only simulations of returns for estimating risk budgeting portfolios. Specifically, we provide a Sample Average Approximation (SAA) algorithm with cutting planes, and a Stochastic Gradient Decent (SGD) algorithm, tailored to the risk budgeting portfolio for the Expected Shortfall. We illustrate different risk budgeting portfolios, constructed using a especially designed Julia package, on real financial data and compare it to classical portfolio strategies.",
        "url": "https://doi.org/10.1016/j.ejor.2023.06.003",
        "pages": "1040-1056",
        "isuue": "3",
        "volume": "311",
        "journal": "European Journal of Operational Research",
        "year": "2023",
        "author": "da Costa, Bernardo Freitas Paulo and Pesenti, Silvana and Targino, Rodrigo S.",
        "title": "Risk Budgeting Portfolios from Simulations",
        "ENTRYTYPE": "article",
        "ID": "dacosta2023risk"
    },
    "benezet2021transform": {
        "abstract": "In financial risk management, modelling dependency within a random vector X is crucial, a standard approach is the use of a copula model. Say the copula model can be sampled through realizations of X having copula function C: had the marginals of Y been known, sampling Xi, the i-th component of X, would directly follow by composing Yi with its cumulative distribution function (c.d.f.) and the inverse c.d.f. of Xi. In this work, the marginals of Y are not explicit, as in a factor copula model. We design an algorithm which samples X through an empirical approximation of the c.d.f. of the Y-marginals. To be able to handle complex distributions for Y or rare-event computations, we allow Markov Chain Monte Carlo (MCMC) samplers. We establish convergence results whose rates depend on the tails of X, Y and the Lyapunov function of the MCMC sampler. We present numerical experiments confirming the convergence rates and also revisit a real data analysis from financial risk management.",
        "url": "https://doi.org/10.1007/s11009-023-09983-4",
        "volume": "25",
        "journal": "Methodology and Computing in Applied Probability",
        "year": "2023",
        "author": "Benezet, Cyril and Gobet, Emmanuel and Targino, Rodrigo S.",
        "title": "Transform MCMC schemes for sampling intractable factor copula models",
        "ENTRYTYPE": "article",
        "ID": "benezet2021transform"
    },
    "saporito2022avoiding": {
        "abstract": "This paper is concerned with the process of risk allocation for a generic multivariate model when the risk measure is chosen as the Value-at-Risk (VaR). Making use of Malliavin calculus, we recast the traditional Euler contributions from an expectation conditional to an event of zero probability to a ratio of conditional expectations, where both the numerator and the denominator's conditioning events have positive probability. For several different models we show empirically that the estimator using this novel representation has no perceivable bias and variance smaller than a standard estimator used in practice.",
        "doi": "https://doi.org/10.1016/j.insmatheco.2022.06.004",
        "publisher": "Elsevier",
        "year": "2022",
        "pages": "173--192",
        "volume": "106",
        "journal": "Insurance: Mathematics and Economics",
        "author": "Koike, Takaaki and Saporito, Yuri F and Targino, Rodrigo S",
        "title": "Avoiding zero probability events when computing Value at Risk contributions",
        "ENTRYTYPE": "article",
        "ID": "saporito2022avoiding"
    },
    "nieto2021": {
        "doi": "http://doi.org/10.1017/asb.2020.36",
        "abstract": "We propose a stochastic model for claims reserving that captures dependence along development years within a single triangle. This dependence is of autoregressive form of order  and is achieved through the use of latent variables. We carry out bayesian inference on model parameters and borrow strength across several triangles, coming from different lines of businesses or companies, through the use of hierarchical priors.",
        "publisher": "Cambridge University Press",
        "pages": "245--266",
        "number": "4",
        "volume": "51",
        "year": "2021",
        "journal": "ASTIN Bulletin: The Journal of the IAA",
        "author": "Nieto-Barajas, Luis E and Targino, Rodrigo S",
        "title": "A gamma moving average process for modelling dependence across development years in run-off triangles",
        "ENTRYTYPE": "article",
        "ID": "nieto2021"
    },
    "merkle2020bayesian": {
        "abstract": "We propose a two stage procedure for the estimation of the parameters of a fairly general, continuous-time stochastic volatility model. An important ingredient of the proposed method is the Cuchiero–Teichmann volatility estimator, which is based on Fourier transforms and provides a continuous-time estimate of the latent process. This estimate is then used to construct an approximate likelihood for the parameters of interest, whose restrictions are taken into account through prior distributions. The procedure is shown to be highly successful for constructing the posterior distribution of the parameters of a Heston model, while limited success is achieved when applied to the highly parametrized exponential-Ornstein–Uhlenbeck.",
        "doi": "https://doi.org/10.1016/j.spl.2019.108600",
        "publisher": "Elsevier",
        "year": "2020",
        "pages": "108600",
        "volume": "156",
        "journal": "Statistics and Probability Letters",
        "author": "Merkle, Milan and Saporito, Yuri F and Targino, Rodrigo S",
        "title": "Bayesian approach for parameter estimation of continuous-time stochastic volatility models using Fourier transform methods",
        "ENTRYTYPE": "article",
        "ID": "merkle2020bayesian"
    },
    "peters2017bayesian": {
        "abstract": "The main objective of this work is to develop a detailed step-by-step guide to the development and application of a new class of efficient Monte Carlo methods to solve practically important problems faced by insurers under the new solvency regulations. In particular, a novel Monte Carlo method to calculate capital allocations for a general insurance company is developed, with a focus on coherent capital allocation that is compliant with the Swiss Solvency Test. The data used is based on the balance sheet of a representative stylized company. For each line of business in that company, allocations are calculated for the one-year risk with dependencies based on correlations given by the Swiss Solvency Test. Two different approaches for dealing with parameter uncertainty are discussed and simulation algorithms based on (pseudo-marginal) Sequential Monte Carlo algorithms are described and their efficiency is analysed.",
        "doi": "https://doi.org/10.3390/risks5040053",
        "publisher": "Multidisciplinary Digital Publishing Institute",
        "year": "2017",
        "pages": "53",
        "number": "4",
        "volume": "5",
        "journal": "Risks",
        "author": "Peters, Gareth W and Targino, Rodrigo S and Wuthrich, Mario V",
        "title": "Bayesian modelling, Monte Carlo sampling and capital allocation of insurance risks",
        "ENTRYTYPE": "article",
        "ID": "peters2017bayesian"
    },
    "targino2017optimal": {
        "abstract": "In this paper we demonstrate how to develop analytic closed form solutions to optimal multiple stopping time problems arising in the setting in which the value function acts on a compound process that is modified by the actions taken at the stopping times. This class of problem is particularly relevant in insurance and risk management settings and we demonstrate this on an important application domain based on insurance strategies in Operational Risk management for financial institutions. In this area of risk management the most prevalent class of loss process models is the Loss Distribution Approach (LDA) framework which involves modelling annual losses via a compound process. Given an LDA model framework, we consider Operational Risk insurance products that mitigate the risk for such loss processes and may reduce capital requirements. In particular, we consider insurance products that grant the policy holder the right to insure k of its annual Operational losses in a horizon of T years. We consider two insurance product structures and two general model settings, the first are families of relevant LDA loss models that we can obtain closed form optimal stopping rules for under each generic insurance mitigation structure and then secondly classes of LDA models for which we can develop closed form approximations of the optimal stopping rules. In particular, for losses following a compound Poisson process with jump size given by an Inverse-Gaussian distribution and two generic types of insurance mitigation, we are able to derive analytic expressions for the loss process modified by the insurance application, as well as closed form solutions for the optimal multiple stopping rules in discrete time (annually). When the combination of insurance mitigation and jump size distribution does not lead to tractable stopping rules we develop a principled class of closed form approximations to the optimal decision rule. These approximations are developed based on a class of orthogonal Askey polynomial series basis expansion representations of the annual loss compound process distribution and functions of this annual loss.",
        "doi": "http://dx.doi.org/10.1007/s11009-016-9493-8",
        "publisher": "Springer",
        "year": "2017",
        "pages": "487--518",
        "number": "2",
        "volume": "19",
        "journal": "Methodology and Computing in Applied Probability",
        "author": "Targino, Rodrigo S and Peters, Gareth W and Sofronov, Georgy and Shevchenko, Pavel V",
        "title": "Optimal exercise strategies for operational risk insurance via multiple stopping times",
        "ENTRYTYPE": "article",
        "ID": "targino2017optimal"
    },
    "peters2017full": {
        "abstract": "We revisit the gamma–gamma Bayesian chain-ladder (BCL) model for claims reserving in non-life insurance. This claims reserving model is usually used in an empirical Bayesian way using plug-in estimates for the variance parameters. The advantage of this empirical Bayesian framework is that allows us for closed form solutions. The main purpose of this paper is to develop the full Bayesian case also considering prior distributions for the variance parameters and to study the resulting sensitivities. ",
        "doi": "http://dx.doi.org/10.1016/j.insmatheco.2016.12.007",
        "publisher": "Elsevier",
        "year": "2017",
        "pages": "41--53",
        "volume": "73",
        "journal": "Insurance: Mathematics and Economics",
        "author": "Peters, Gareth W and Targino, Rodrigo S and Wuthrich, Mario V",
        "title": "Full bayesian analysis of claims reserving uncertainty",
        "ENTRYTYPE": "article",
        "ID": "peters2017full"
    },
    "targino2015sequential": {
        "abstract": "In this paper we assume a multivariate risk model has been developed for a portfolio and its capital derived as a homogeneous risk measure. The Euler (or gradient) principle, then, states that the capital to be allocated to each component of the portfolio has to be calculated as an expectation conditional to a rare event, which can be challenging to evaluate in practice. We exploit the copula-dependence within the portfolio risks to design a Sequential Monte Carlo Samplers based estimate to the marginal conditional expectations involved in the problem, showing its efficiency through a series of computational examples.",
        "doi": "https://doi.org/10.1016/j.insmatheco.2015.01.007",
        "publisher": "Elsevier",
        "year": "2015",
        "pages": "206--226",
        "volume": "61",
        "journal": "Insurance: Mathematics and Economics",
        "author": "Targino, Rodrigo S and Peters, Gareth W and Shevchenko, Pavel V",
        "title": "Sequential Monte Carlo Samplers for capital allocation under copula-dependent risk models",
        "ENTRYTYPE": "article",
        "ID": "targino2015sequential"
    },
    "peters2013understanding": {
        "abstract": "We set the context for capital approximation within the framework of the Basel II / III regulatory capital accords. This is particularly topical as the Basel III accord is shortly due to take effect. In this regard, we provide a summary of the role of capital adequacy in the new accord, highlighting along the way the significant loss events that have been attributed to the Operational Risk class that was introduced in the Basel II and III accords. Then we provide a semi-tutorial discussion on the modelling aspects of capital estimation under a Loss Distributional Approach (LDA). Our emphasis is to focus on the important loss processes with regard to those that contribute most to capital, the so called high consequence, low frequency loss processes. This leads us to provide a tutorial overview of heavy tailed loss process modelling in OpRisk under Basel III, with discussion on the implications of such tail assumptions for the severity model in an LDA structure. This provides practitioners with a clear understanding of the features that they may wish to consider when developing OpRisk severity models in practice. From this discussion on heavy tailed severity models, we then develop an understanding of the impact such models have on the right tail asymptotics of the compound loss process and we provide detailed presentation of what are known as first and second order tail approximations for the resulting heavy tailed loss process. From this we develop a tutorial on three key families of risk measures and their equivalent second order asymptotic approximations: Value-at-Risk (Basel III industry standard); Expected Shortfall (ES) and the Spectral Risk Measure. These then form the capital approximations.",
        "doi": "https://doi.org/10.22495/jgr_v2_i3_p6",
        "year": "2013",
        "number": "3",
        "volume": "2",
        "journal": "The Journal of Governance and Regulation",
        "author": "Peters, Gareth W and Targino, Rodrigo S and Shevchenko, Pavel V",
        "title": "Understanding operational risk capital approximations: first and second orders",
        "ENTRYTYPE": "article",
        "ID": "peters2013understanding"
    }
}